RIET/src/Documents/TR_Adjustment/TR_Adjustment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TR_Adjustment</name>
  <basedOn>Document.TransportRequest</basedOn>
  <registerRecords>AccumulationRegister.ParcelsOfTransportRequestsWithoutShipment</registerRecords>
  <attributes>
    <name>TR</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
    <attributes>
      <name>NumOfParcels</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/ParcelsOfTransportRequestsWithoutShipment/ParcelsOfTransportRequestsWithoutShipment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ParcelsOfTransportRequestsWithoutShipment</name>
  <resources>
    <name>NumOfParcels</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Parcel</name>
    <type>
      <types>CatalogRef.Parcels</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/TR_Adjustment/ManagerModule.bsl
Функция ПроверитьОстатокПоПарселю(Парсель, TR, TR_Adj) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ParcelsOfTransportRequestsWithoutShipmentОстаткиИОбороты.NumOfParcelsКонечныйОстаток КАК NumOfParcelsОстаток
	|ИЗ
	|	РегистрНакопления.ParcelsOfTransportRequestsWithoutShipment.ОстаткиИОбороты(
	|			,
	|			,
	|			Регистратор,
	|			,
	|			Parcel = &Парсель
	|				И TransportRequest = &TransportRequest) КАК ParcelsOfTransportRequestsWithoutShipmentОстаткиИОбороты
	|ГДЕ
	|	ParcelsOfTransportRequestsWithoutShipmentОстаткиИОбороты.Регистратор <> &TR_Adj
	|
	|УПОРЯДОЧИТЬ ПО
	|	ParcelsOfTransportRequestsWithoutShipmentОстаткиИОбороты.Регистратор.Дата УБЫВ";
	Запрос.УстановитьПараметр("Парсель", Парсель);
	Запрос.УстановитьПараметр("TransportRequest", TR);
	Запрос.УстановитьПараметр("TR_Adj", TR_Adj);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Количество = 0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Количество = Выборка.NumOfParcelsОстаток;
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции

Функция ПолучитьОстатки(TransportRequest, ДатаДока) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ParcelsOfTransportRequestsWithoutShipmentОстатки.Parcel,
	|	ParcelsOfTransportRequestsWithoutShipmentОстатки.NumOfParcelsОстаток КАК NumOfParcels
	|ИЗ
	|	РегистрНакопления.ParcelsOfTransportRequestsWithoutShipment.Остатки(&ДатаДока, TransportRequest = &TR) КАК ParcelsOfTransportRequestsWithoutShipmentОстатки";
	Запрос.УстановитьПараметр("TR", TransportRequest);
	Запрос.УстановитьПараметр("ДатаДока", ДатаДока);
	
	Возврат Запрос;
	
КонецФункции
